[
  {
    "sentence": "Mein Lieblingsbuch ist ein Klassiker der Weltliteratur.",
    "translation": "My favorite book is a classic of world literature."
  },
  {
    "sentence": "Mein erster Eindruck von der Stadt war sehr positiv.",
    "translation": "My first impression of the city was very positive."
  },
  {
    "sentence": "Unser Besuch im Museum war äußerst interessant.",
    "translation": "Our visit to the museum was extremely interesting."
  },
  {
    "sentence": "In der Schule lerne ich gerne neue Dinge.",
    "translation": "I like learning new things in school."
  },
  {
    "sentence": "Paris ist bekannt für seine beeindruckende Architektur.",
    "translation": "Paris is known for its impressive architecture."
  },
  {
    "sentence": "Gestern war ein sonniger Tag und ich genoss es, draußen zu sein.",
    "translation": "Yesterday was a sunny day and I enjoyed being outside."
  },
  {
    "sentence": "Eine Tasse Tee am Abend entspannt mich immer.",
    "translation": "A cup of tea in the evening always relaxes me."
  },
  {
    "sentence": "Unser unvergesslicher Ausflug in die Berge bleibt mir immer in Erinnerung.",
    "translation": "Our unforgettable trip to the mountains always stays in my memory."
  },
  {
    "sentence": "Das Auslandssemester war eine einzigartige Erfahrung für mich.",
    "translation": "The semester abroad was a unique experience for me."
  },
  {
    "sentence": "Der Himmel war am Abend besonders schön.",
    "translation": "The sky was particularly beautiful in the evening."
  },
  {
    "sentence": "Der Unterricht in Geschichte war besonders interessant.",
    "translation": "The history lesson was particularly interesting."
  },
  {
    "sentence": "Den Kuchen habe ich gestern gebacken.",
    "translation": "I baked the cake yesterday."
  },
  {
    "sentence": "Ich liebe es, am Wochenende Zeit mit meiner Familie zu verbringen.",
    "translation": "I love spending time with my family on weekends."
  },
  {
    "sentence": "Meiner Meinung nach sollten wir mehr über Umweltschutz sprechen.",
    "translation": "In my opinion, we should talk more about environmental protection."
  },
  {
    "sentence": "Meine Kindheitserinnerungen sind voller Glücksmomente.",
    "translation": "My childhood memories are full of happy moments."
  },
  {
    "sentence": "Sie erhielt eine Auszeichnung für ihre Arbeit im Unternehmen.",
    "translation": "She received an award for her work at the company."
  },
  {
    "sentence": "Die Begegnung mit diesem Autor prägte mein Denken nachhaltig.",
    "translation": "Meeting this author shaped my thinking profoundly."
  },
  {
    "sentence": "Mich interessiert besonders die Kunst des 20. Jahrhunderts.",
    "translation": "I am particularly interested in 20th-century art."
  },
  {
    "sentence": "Wir müssen nachhaltige Lösungen für die Umwelt finden.",
    "translation": "We need to find sustainable solutions for the environment."
  },
  {
    "sentence": "Bis zum Wochenende muss ich noch einige Aufgaben erledigen.",
    "translation": "I still have some tasks to complete by the weekend."
  },
  {
    "sentence": "Der Abschluss der Verhandlungen steht kurz bevor.",
    "translation": "The conclusion of the negotiations is imminent."
  },
  {
    "sentence": "Meiner Ansicht nach sollten wir das Projekt sofort starten.",
    "translation": "In my view, we should start the project immediately."
  },
  {
    "sentence": "Die Ausbildung zum Facharbeiter dauert drei Jahre.",
    "translation": "The training for skilled workers takes three years."
  },
  {
    "sentence": "Gestern habe ich einen interessanten Artikel gelesen.",
    "translation": "Yesterday, I read an interesting article."
  },
  {
    "sentence": "Sie arbeitet hart, um ihre Ziele zu erreichen.",
    "translation": "She works hard to achieve her goals."
  },
  {
    "sentence": "Ich habe den ganzen Tag hart gearbeitet.",
    "translation": "I worked hard all day."
  },
  {
    "sentence": "Zum Glück hatte ich genug Zeit, um alles rechtzeitig zu erledigen.",
    "translation": "Fortunately, I had enough time to do everything on time."
  },
  {
    "sentence": "Zum Geburtstag meiner Schwester haben wir eine Überraschungsparty organisiert.",
    "translation": "We organized a surprise party for my sister's birthday."
  },
  {
    "sentence": "Meiner Meinung nach sollten wir öfter solche Veranstaltungen besuchen.",
    "translation": "In my opinion, we should attend such events more often."
  },
  {
    "sentence": "Meine Mutter kocht am besten.",
    "translation": "My mother cooks the best."
  },
  {
    "sentence": "Wir haben gestern eine neue Wohnung gefunden.",
    "translation": "We found a new apartment yesterday."
  },
  {
    "sentence": "Wir alle müssen unseren Beitrag zum Umweltschutz leisten.",
    "translation": "We all have to contribute to environmental protection."
  },
  {
    "sentence": "Eine gute Freundin zu haben, ist unbezahlbar.",
    "translation": "Having a good friend is priceless."
  },
  {
    "sentence": "Die Überraschungsparty war ein voller Erfolg.",
    "translation": "The surprise party was a complete success."
  },
  {
    "sentence": "Das Eintritt zum Konzert war nicht billig.",
    "translation": "The admission to the concert was not cheap."
  },
  {
    "sentence": "Zurzeit lese ich gerne Bücher über Geschichte.",
    "translation": "Currently, I enjoy reading books about history."
  },
  {
    "sentence": "Diese Frage ist nicht einfach zu beantworten.",
    "translation": "This question is not easy to answer."
  },
  {
    "sentence": "Das Geschenk war für meinen Geburtstag.",
    "translation": "The gift was for my birthday."
  },
  {
    "sentence": "Mitglieder haben Zugang zu exklusiven Angeboten.",
    "translation": "Members have access to exclusive offers."
  },
  {
    "sentence": "Die Broschüre können Sie kostenlos herunterladen.",
    "translation": "You can download the brochure for free."
  },
  {
    "sentence": "In der Stadt gibt es viele interessante Sehenswürdigkeiten In.",
    "translation": "In the city, there are many interesting sights."
  },
  {
    "sentence": "In meiner Freizeit spiele ich gerne Gitarre.",
    "translation": "In my leisure time, I enjoy playing the guitar."
  },
  {
    "sentence": "Ich engagiere mich aktiv in unserer Gemeinde.",
    "translation": "I actively engage in our community."
  },
  {
    "sentence": "Mich interessiert besonders die politische Situation im Nahen Osten.",
    "translation": "I am particularly interested in the political situation in the Middle East."
  },
  {
    "sentence": "Ich koche gerne neue Rezepte aus.",
    "translation": "I like to cook new recipes."
  },
  {
    "sentence": "In fernen Ländern gibt es oft exotische Gerichte In.",
    "translation": "In distant countries, there are often exotic dishes."
  },
  {
    "sentence": "In vielen Ländern herrscht derzeit politische Instabilität countries.",
    "translation": "There is currently political instability in many countries."
  },
  {
    "sentence": "Das Gymnasium, das ich besuchte, hatte einen großen Campus.",
    "translation": "The high school I attended had a large campus."
  },
  {
    "sentence": "Das Essen im Restaurant im köstlich.",
    "translation": "The food at the restaurant was delicious."
  },
  {
    "sentence": "Ich habe heute Abend keine Zeit, etwas zu unternehmen.",
    "translation": "I don't have time to do anything tonight."
  },
  {
    "sentence": "Ich besuchte letztes Jahr eine Ausstellung über moderne Kunst.",
    "translation": "Last year, I visited an exhibition on modern art."
  },
  {
    "sentence": "Die Stadt bot eine Vielzahl kultureller Veranstaltungen an.",
    "translation": "The city offered a variety of cultural events."
  },
  {
    "sentence": "Eine gute Ausbildung ist, zum der Schlüssel ist, zum Erfolg.",
    "translation": "A good education is the key to success."
  },
  {
    "sentence": "Die Stadt bietet eine vielfältige Auswahl an Freizeitmöglichkeiten.",
    "translation": "The city offers a diverse range of leisure activities."
  },
  {
    "sentence": "Die Auswahl an, in, ist Restaurants an, in, ist der Stadt an, in, ist beeindruckend.",
    "translation": "The selection of restaurants in the city is impressive."
  },
  {
    "sentence": "An der Universität habe ich viele interessante Menschen kennengelernt.",
    "translation": "At university, I met many interesting people."
  },
  {
    "sentence": "Die Schule bietet eine breite Palette an, an Fächern an, an.",
    "translation": "The school offers a wide range of subjects."
  },
  {
    "sentence": "Ich freue mich schon auf das nächste Treffen.",
    "translation": "I'm looking forward to the next meeting."
  },
  {
    "sentence": "Ich bin der Meinung, dass wir das Projekt unterstützen sollten.",
    "translation": "I am of the opinion that we should support the project."
  },
  {
    "sentence": "Das Essen war sehr lecker.",
    "translation": "The food was very delicious."
  },
  {
    "sentence": "Meine Eltern sind, auf sehr stolz sind, auf mich.",
    "translation": "My parents are very proud of me."
  },
  {
    "sentence": "Auf dem Tisch stand eine, mit Vase eine, mit frischen Blumen.",
    "translation": "On the table, there was a vase with fresh flowers."
  },
  {
    "sentence": "Die Leistung des, war Teams des, war beeindruckend.",
    "translation": "The team's performance was impressive."
  },
  {
    "sentence": "Die Unterstützung meiner Familie bedeutet mir viel.",
    "translation": "The support of my family means a lot to me."
  },
  {
    "sentence": "Die Arbeit im Garten macht mir Spaß.",
    "translation": "Working in the garden is fun for me."
  },
  {
    "sentence": "Ich habe gestern einen langen Spaziergang gemacht.",
    "translation": "I went for a long walk yesterday."
  },
  {
    "sentence": "Von dieser Idee bin ich sehr begeistert.",
    "translation": "I am very excited about this idea."
  },
  {
    "sentence": "Meinem Freund habe ich zum Geburtstag ein Buch geschenkt.",
    "translation": "I gave a book to my friend for his birthday."
  }
]